social_net/perf_testing/data/composePost/202404261309_1000_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 1544.270ms, rate sampling interval: 5595ms
  Thread calibration: mean lat.: 1503.803ms, rate sampling interval: 5443ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.84s     3.26s   14.41s    85.34%
    Req/Sec   241.50     43.96   307.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.05s 
 75.000%    6.07s 
 90.000%   12.86s 
 99.000%   14.41s 
 99.900%   21.86s 
 99.990%   21.94s 
 99.999%   21.95s 
100.000%   21.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2320.383     0.000000            1         1.00
    3147.775     0.100000          973         1.11
    3483.647     0.200000         1951         1.25
    3858.431     0.300000         2916         1.43
    4505.599     0.400000         3892         1.67
    5054.463     0.500000         4860         2.00
    5283.839     0.550000         5347         2.22
    5509.119     0.600000         5832         2.50
    5701.631     0.650000         6319         2.86
    5881.855     0.700000         6803         3.33
    6074.367     0.750000         7289         4.00
    6180.863     0.775000         7538         4.44
    6320.127     0.800000         7779         5.00
    6471.679     0.825000         8021         5.71
    6803.455     0.850000         8264         6.67
   11780.095     0.875000         8505         8.00
   12378.111     0.887500         8625         8.89
   12861.439     0.900000         8748        10.00
   13197.311     0.912500         8869        11.43
   13451.263     0.925000         8990        13.33
   13598.719     0.937500         9111        16.00
   13688.831     0.943750         9172        17.78
   13778.943     0.950000         9236        20.00
   13844.479     0.956250         9300        22.86
   13910.015     0.962500         9356        26.67
   13991.935     0.968750         9416        32.00
   14032.895     0.971875         9446        35.56
   14082.047     0.975000         9477        40.00
   14131.199     0.978125         9508        45.71
   14188.543     0.981250         9536        53.33
   14237.695     0.984375         9567        64.00
   14278.655     0.985938         9582        71.11
   14335.999     0.987500         9597        80.00
   14385.151     0.989062         9613        91.43
   14434.303     0.990625         9628       106.67
   14581.759     0.992188         9644       128.00
   14655.487     0.992969         9652       142.22
   14721.023     0.993750         9658       160.00
   14778.367     0.994531         9665       182.86
   14827.519     0.995313         9674       213.33
   14876.671     0.996094         9681       256.00
   14893.055     0.996484         9684       284.44
   14917.631     0.996875         9688       320.00
   14942.207     0.997266         9693       365.71
   21594.111     0.997656         9696       426.67
   21692.415     0.998047         9700       512.00
   21725.183     0.998242         9701       568.89
   21774.335     0.998437         9703       640.00
   21823.487     0.998633         9706       731.43
   21856.255     0.998828         9708       853.33
   21889.023     0.999023         9711      1024.00
   21889.023     0.999121         9711      1137.78
   21889.023     0.999219         9711      1280.00
   21905.407     0.999316         9712      1462.86
   21921.791     0.999414         9714      1706.67
   21921.791     0.999512         9714      2048.00
   21921.791     0.999561         9714      2275.56
   21938.175     0.999609         9717      2560.00
   21938.175     0.999658         9717      2925.71
   21938.175     0.999707         9717      3413.33
   21938.175     0.999756         9717      4096.00
   21938.175     0.999780         9717      4551.11
   21938.175     0.999805         9717      5120.00
   21938.175     0.999829         9717      5851.43
   21938.175     0.999854         9717      6826.67
   21938.175     0.999878         9717      8192.00
   21938.175     0.999890         9717      9102.22
   21954.559     0.999902         9718     10240.00
   21954.559     1.000000         9718          inf
#[Mean    =     5840.769, StdDeviation   =     3256.485]
#[Max     =    21938.176, Total count    =         9718]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  14699 requests in 30.01s, 3.98MB read
  Non-2xx or 3xx responses: 113
Requests/sec:    489.85  
Transfer/sec:    135.80KB