social_net/perf_testing/data/composePost/202404261328_300_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 109.433ms, rate sampling interval: 300ms
  Thread calibration: mean lat.: 114.254ms, rate sampling interval: 326ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.02s     2.70s   13.40s    89.62%
    Req/Sec   114.05     23.17   159.00     73.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   99.01ms
 75.000%  117.76ms
 90.000%    3.99s 
 99.000%   13.40s 
 99.900%   18.35s 
 99.990%   19.02s 
 99.999%   19.02s 
100.000%   19.02s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      15.127     0.000000            1         1.00
      86.591     0.100000          458         1.11
      90.367     0.200000          918         1.25
      93.311     0.300000         1365         1.43
      96.127     0.400000         1821         1.67
      99.007     0.500000         2275         2.00
     100.671     0.550000         2500         2.22
     102.527     0.600000         2728         2.50
     104.959     0.650000         2952         2.86
     109.183     0.700000         3180         3.33
     117.759     0.750000         3405         4.00
     126.335     0.775000         3520         4.44
     137.599     0.800000         3634         5.00
     166.143     0.825000         3745         5.71
     245.887     0.850000         3859         6.67
    2021.375     0.875000         3972         8.00
    3004.415     0.887500         4029         8.89
    4003.839     0.900000         4086        10.00
    4853.759     0.912500         4142        11.43
    5832.703     0.925000         4199        13.33
    6823.935     0.937500         4257        16.00
    7294.975     0.943750         4284        17.78
    7802.879     0.950000         4313        20.00
    8265.727     0.956250         4341        22.86
    8724.479     0.962500         4369        26.67
    9142.271     0.968750         4398        32.00
    9338.879     0.971875         4412        35.56
    9543.679     0.975000         4426        40.00
    9764.863     0.978125         4443        45.71
   10018.815     0.981250         4459        53.33
   10190.847     0.984375         4469        64.00
   11141.119     0.985938         4476        71.11
   11993.087     0.987500         4483        80.00
   12902.399     0.989062         4490        91.43
   13778.943     0.990625         4497       106.67
   14680.063     0.992188         4504       128.00
   15196.159     0.992969         4508       142.22
   15564.799     0.993750         4511       160.00
   16089.087     0.994531         4515       182.86
   16449.535     0.995313         4518       213.33
   16941.055     0.996094         4522       256.00
   17170.431     0.996484         4524       284.44
   17350.655     0.996875         4525       320.00
   17596.415     0.997266         4527       365.71
   17825.791     0.997656         4529       426.67
   17989.631     0.998047         4531       512.00
   18202.623     0.998242         4532       568.89
   18202.623     0.998437         4532       640.00
   18235.391     0.998633         4533       731.43
   18350.079     0.998828         4534       853.33
   18481.151     0.999023         4535      1024.00
   18612.223     0.999121         4536      1137.78
   18612.223     0.999219         4536      1280.00
   18612.223     0.999316         4536      1462.86
   18726.911     0.999414         4537      1706.67
   18726.911     0.999512         4537      2048.00
   18874.367     0.999561         4538      2275.56
   18874.367     0.999609         4538      2560.00
   18874.367     0.999658         4538      2925.71
   18874.367     0.999707         4538      3413.33
   18874.367     0.999756         4538      4096.00
   19021.823     0.999780         4539      4551.11
   19021.823     1.000000         4539          inf
#[Mean    =     1020.027, StdDeviation   =     2697.828]
#[Max     =    19005.440, Total count    =         4539]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  6681 requests in 30.05s, 1.81MB read
  Non-2xx or 3xx responses: 39
Requests/sec:    222.33  
Transfer/sec:     61.58KB