social_net/perf_testing/data/composePost/202404261331_550_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 187.748ms, rate sampling interval: 747ms
  Thread calibration: mean lat.: 192.965ms, rate sampling interval: 791ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.19s     2.47s    9.71s    86.17%
    Req/Sec   215.33     39.27   276.00     72.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  121.28ms
 75.000%  292.35ms
 90.000%    5.50s 
 99.000%    9.71s 
 99.900%   10.12s 
 99.990%   10.31s 
 99.999%   10.40s 
100.000%   10.40s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      14.159     0.000000            1         1.00
      89.407     0.100000          861         1.11
      94.463     0.200000         1727         1.25
      99.007     0.300000         2584         1.43
     104.703     0.400000         3444         1.67
     121.279     0.500000         4304         2.00
     137.727     0.550000         4735         2.22
     164.479     0.600000         5165         2.50
     190.591     0.650000         5595         2.86
     231.551     0.700000         6025         3.33
     292.351     0.750000         6455         4.00
     337.407     0.775000         6670         4.44
     401.919     0.800000         6885         5.00
    1557.503     0.825000         7101         5.71
    3078.143     0.850000         7316         6.67
    4206.591     0.875000         7532         8.00
    4849.663     0.887500         7638         8.89
    5500.927     0.900000         7746        10.00
    6090.751     0.912500         7853        11.43
    6623.231     0.925000         7961        13.33
    7303.167     0.937500         8069        16.00
    7585.791     0.943750         8122        17.78
    7864.319     0.950000         8176        20.00
    8224.767     0.956250         8231        22.86
    8511.487     0.962500         8284        26.67
    8830.975     0.968750         8341        32.00
    8953.855     0.971875         8364        35.56
    9093.119     0.975000         8391        40.00
    9224.191     0.978125         8418        45.71
    9379.839     0.981250         8446        53.33
    9510.911     0.984375         8474        64.00
    9568.255     0.985938         8487        71.11
    9633.791     0.987500         8501        80.00
    9691.135     0.989062         8512        91.43
    9732.095     0.990625         8526       106.67
    9814.015     0.992188         8542       128.00
    9854.975     0.992969         8547       142.22
    9887.743     0.993750         8553       160.00
    9912.319     0.994531         8559       182.86
    9945.087     0.995313         8566       213.33
    9994.239     0.996094         8574       256.00
   10002.431     0.996484         8576       284.44
   10018.815     0.996875         8585       320.00
   10018.815     0.997266         8585       365.71
   10027.007     0.997656         8590       426.67
   10027.007     0.998047         8590       512.00
   10059.775     0.998242         8591       568.89
   10076.159     0.998437         8593       640.00
   10092.543     0.998633         8596       731.43
   10092.543     0.998828         8596       853.33
   10166.271     0.999023         8598      1024.00
   10174.463     0.999121         8600      1137.78
   10174.463     0.999219         8600      1280.00
   10199.039     0.999316         8601      1462.86
   10199.039     0.999414         8601      1706.67
   10207.231     0.999512         8602      2048.00
   10272.767     0.999561         8603      2275.56
   10272.767     0.999609         8603      2560.00
   10305.535     0.999658         8604      2925.71
   10305.535     0.999707         8604      3413.33
   10305.535     0.999756         8604      4096.00
   10313.727     0.999780         8605      4551.11
   10313.727     0.999805         8605      5120.00
   10313.727     0.999829         8605      5851.43
   10313.727     0.999854         8605      6826.67
   10313.727     0.999878         8605      8192.00
   10403.839     0.999890         8606      9102.22
   10403.839     1.000000         8606          inf
#[Mean    =     1188.223, StdDeviation   =     2465.707]
#[Max     =    10395.648, Total count    =         8606]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  13399 requests in 30.05s, 3.62MB read
  Non-2xx or 3xx responses: 37
Requests/sec:    445.87  
Transfer/sec:    123.50KB